backend/app/controllers/couples_controller.rb

    def index
        couples = Couple.all
---
SELECT "couples".* FROM "couples"

    def show
        couple = Couple.find_by(id: params[:id])
---
SELECT "couples".* FROM "couples" WHERE "couples"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        couple = Couple.create(couple_params)
---
INSERT INTO "couples" ("father", "mother", "breed", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["father", "New Father"], ["mother", "New Mother"], ["breed", "New Breed"], ["created_at", "2022-01-24 02:02:09.344994"], ["updated_at", "2022-01-24 02:02:09.344994"]]

    def destroy
        couple = Couple.find_by(id: params[:id])
        couple.destroy
---
SELECT "couples".* FROM "couples" WHERE "couples"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "couples" WHERE "couples"."id" = ?  [["id", 4]]