backend/app/controllers/puppies_controller.rb

    def index
        puppies = Puppy.all
---
SELECT "puppies".* FROM "puppies"

    def show
        puppy = Puppy.find_by(id: params[:id])
---
SELECT "puppies".* FROM "puppies" WHERE "puppies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        puppy = Puppy.create(puppy_params)
---
INSERT INTO "puppies" ("name", "breed", "price", "sex", "couple_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "New Pup"], ["breed", "Pup Breed"], ["price", 1], ["sex", "male"], ["couple_id", 1], ["created_at", "2022-01-30 23:21:27.908115"], ["updated_at", "2022-01-30 23:21:27.908115"]]

    def destroy
        puppy = Puppy.find_by(id: params[:id])
        puppy.destroy
---
SELECT "puppies".* FROM "puppies" WHERE "puppies"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
DELETE FROM "puppies" WHERE "puppies"."id" = ?  [["id", 9]]